def area(a, b, c):
    '''
    Возвращает площадь треугольника со сторонами длины a, b, c:

    Параметры:
             a (float) - длина стороны треугольника a
             b (float) - длина стороны треугольника b
             c (float) - длина стороны треугольника c

    Возвращаемое значение:
             area (float) - площадь треугольника
    '''
    return (a + b + c) / 2


def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника со сторонами длины a, b, c:

    Параметры:
             a (float) - длина стороны треугольника a
             b (float) - длина стороны треугольника b
             c (float) - длина стороны треугольника c

    Возвращаемое значение:
             perimeter (float) - периметр треугольника
    '''
    return a + b + c
